## Pandas Excel Tutorial: How to Read and Write Excel files

This tutorial provides a short guide on how to effectively work with Excel files and Python. It covers introductory topics such as loading and writing spreadsheets in Excel using Pandas. The tutorial includes several examples that demonstrate how to read an Excel file, how to extract specific columns from a spreadsheet, how to combine multiple spreadsheets into a single dataframe, and how to read multiple Excel files. Additionally, the tutorial discusses how to convert data into specific datatypes (e.g., using Pandas dtypes). When we have done this, we will continue learning how to write Excel files, name the sheets, and write to multiple sheets.

### How to Read Excel Files to Pandas Dataframes:

In this section we are going to learn how to read Excel files and spreadsheets to Pandas dataframe objects. All examples in this Pandas Excel tutorial use local files. Note, that read_excel also can also load Excel files from a URL to a dataframe. Let's import `pandas`:

In [1]:
import pandas as pd

Now it’s time to learn how to use Pandas read_excel to read in data from an Excel file. The easiest way to use this method is to pass the file name as a string. If we don’t pass any other parameters, such as sheet name, it will read the first sheet in the index. In the first example we are not going to use any parameters:

In [2]:
df = pd.read_excel('./Data/UAE-mean-temperature-by-year-month-2003-2017.xlsx')
df.head()

   year Month_en Month_ar  temperature_C
0  2003      Jan   ينايـر      17.709074
1  2004      Jan   ينايـر      19.508347
2  2005      Jan   ينايـر      17.320500
3  2006      Jan   ينايـر      17.778350
4  2007      Jan   ينايـر      16.629042

Here, the Pandas `read_excel` method reads the data from the Excel file into a Pandas dataframe object. We then store this dataframe in a variable called `df`.

When using `read_excel`, Pandas, by default, assigns a numeric index or row label to the dataframe, and the index starts with zero. In case there is a column that would serve as a better index, we can override the default behavior.
It can be done by setting the `index_col` parameter to a column. It takes a numeric value for setting a single column as an index or a list of numeric values for creating a multi-index. In the example below, we use the column *'year'* as indices. Note, these are not unique, and it may, thus, not make sense to use these values as indices.

In [5]:
df1 = pd.read_excel('./Data/UAE-mean-temperature-by-year-month-2003-2017.xlsx', 
                    sheet_name='Sheet1', index_col='year')
df1.head()

     Month_en Month_ar  temperature_C
year
2003      Jan   ينايـر      17.709074
2004      Jan   ينايـر      19.508347
2005      Jan   ينايـر      17.320500
2006      Jan   ينايـر      17.778350
2007      Jan   ينايـر      16.629042

### Reading Specific Columns using read_excel

When using Pandas  `read_excel` we will automatically get all columns from an Excel files. If we, for some reason, don’t want to parse all columns in the Excel file, we can use the parameter `usecols`. Let's say we want to create a dataframe with the columns *year, Month_en,* and *temperature_C,* only. We can do this by adding 0, 1, and 3 in a list:

In [6]:
cols = [0, 1, 3]

df2=pd.read_excel('./Data/UAE-mean-temperature-by-year-month-2003-2017.xlsx', 
                    sheet_name='Sheet1', usecols = cols)
df2.head()

   year Month_en  temperature_C
0  2003      Jan      17.709074
1  2004      Jan      19.508347
2  2005      Jan      17.320500
3  2006      Jan      17.778350
4  2007      Jan      16.629042

### Pandas Read Excel Example with Missing Data
Missing values can appear as ‘NaN’ (Not a Number), ‘NA’ (Not Available), ‘n/a’, ‘na’, ‘?’, a blank space, an out-of-range value and in many other forms depending on the user(s) filling in the data. In real datasets, missing values are almost unavoidable and they can be caused by several reasons like corrupted data or unrecorded observations.

To handle missing data, we need to first identify them. Pandas identifies some missing value forms by default as NaN values (e.g blank entry, ‘NA’, ‘null’, ‘nan’, ‘n/a’, ‘NULL’) but not some others. To make Pandas recognize other non-default missing value forms (e.g ‘?’, ’na’, ‘Nil’), we can make a list of them and pass them into Pandas.

In [15]:
df3a = pd.read_excel('./Data/UAE-mean-temperature-missing.xlsx', 
                    sheet_name='Sheet1', usecols = cols)
df3a.head()

   year Month_en temperature_C
0  2003      Jan     17.709074
1  2004      Jan     19.508347
2  2005      Jan       17.3205
3  2006      Jan             &
4  2007      Jan           NaN

In the example below, we define a list of missing values (missing_value_forms) and use the parameter `na_values` to include the list for Pandas to recognize.

In [17]:
missing_value_forms=['?','Nil','&']

df3b = pd.read_excel('./Data/UAE-mean-temperature-missing.xlsx', na_values=missing_value_forms,
                    sheet_name='Sheet1', usecols = cols)
df3b.head()

   year Month_en  temperature_C
0  2003      Jan      17.709074
1  2004      Jan      19.508347
2  2005      Jan      17.320500
3  2006      Jan            NaN
4  2007      Jan            NaN

* Read the post Data manipulation with Pandas for three ways of handling missing values (Deletion, Imputation, Interpolation): [Data Science for Beginners: Handling Missing Values With Pandas](https://medium.com/swlh/data-science-for-beginners-how-to-handle-missing-values-with-pandas-73db5fcd46ec)

### How to Skip Rows when Reading an Excel File

Now we will learn how to skip rows when loading an Excel file using Pandas. For this read excel example we will use data that can be downloaded here.

In this example we read the sheet 'session1' which contains  rows that we need to skip. These rows contains some information about the dataset.

We will use the parameters *sheet_name='Session1'* to read the sheet named 'Session1'. Note, the first sheet will be read if we don’t use the sheet_name parameter. In this example the important part is the parameter *skiprow=2*. We use this to skip the first two rows:

In [20]:
df4 = pd.read_excel('./Data/example_sheets1.xlsx', sheet_name='Session1', skiprows=2)
df4.head()

    Name  ID  Mean  Correct  Session
0   Pete   1    32       16        1
1  Steve   2    31       15        1
2   Dave   3    30       14        1

We can obtain the same results as above using the header parameter. In the example Excel file, we use here, the third row contains the headers and we will use the parameter *header=2* to tell Pandas *read_excel* that our headers are on the third row.

In [21]:
df5 = pd.read_excel('./Data/example_sheets1.xlsx', sheet_name='Session1', header=2)
df5.head()

    Name  ID  Mean  Correct  Session
0   Pete   1    32       16        1
1  Steve   2    31       15        1
2   Dave   3    30       14        1

### Reading Multiple Excel Sheets to Pandas Dataframes

Our Excel file, 'example_sheets1.xlsx’, has two sheets: ‘Session1’, and ‘Session2.’ Each sheet has data from an imagined experimental session. In the next example we are going to read both sheets, ‘Session1’ and ‘Session2’. Here’s how to use Pandas read_excel with multiple sheets:

In [22]:
df6 = pd.read_excel('./Data/example_sheets1.xlsx', sheet_name=['Session1', 'Session2'], header=2)

By using the parameter sheet_name, and a list of names, we will get an ordered dictionary containing two dataframes:

In [23]:
df6

{'Session1':     Name  ID  Mean  Correct  Session
 0   Pete   1    32       16        1
 1  Steve   2    31       15        1
 2   Dave   3    30       14        1,
 'Session2':     Name  ID  Mean  Correct  Session
 0   Pete   1    30       14        2
 1  Steve   2    33       17        2
 2   Dave   3    32       16        2}

Maybe we want to join the data from all sheets (in this case sessions). Merging Pandas dataframes are quite easy. We just use the `concat` function and loop over the `keys` (i.e., sheets):

In [25]:
df7 = pd.concat(df6[frame] for frame in df6.keys())
df7

    Name  ID  Mean  Correct  Session
0   Pete   1    32       16        1
1  Steve   2    31       15        1
2   Dave   3    30       14        1
0   Pete   1    30       14        2
1  Steve   2    33       17        2
2   Dave   3    32       16        2

Now in the example Excel file there is a column identifying the dataset (e.g., session number). However, maybe we don’t have that kind of information in our Excel file. To merge the two dataframes and adding a column depicting which session we can use a for loop:

In [26]:
dfs = []
for framename in df6.keys():
    temp_df = df6[framename]
    temp_df['Session'] = framename
    dfs.append(temp_df)
    
df7 = pd.concat(dfs)

df7

    Name  ID  Mean  Correct   Session
0   Pete   1    32       16  Session1
1  Steve   2    31       15  Session1
2   Dave   3    30       14  Session1
0   Pete   1    30       14  Session2
1  Steve   2    33       17  Session2
2   Dave   3    32       16  Session2

In the code above we start by creating a list and continue by looping through the keys in the list of dataframes. Finally, we create a temporary dataframe and take the sheet name and add it in the column ‘Session’.

### Pandas Read Excel all Sheets

If we want to use read_excel to load all sheets from an Excel file to a dataframe it is, of ourse, possible. We can set the parameter sheet_name to None.

In [27]:
all_sheets_df = pd.read_excel('./Data/example_sheets1.xlsx', sheet_name=None)
all_sheets_df

{'Session1':    #Experiment Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
 0  ##Session 1        NaN        NaN        NaN        NaN
 1         Name         ID       Mean    Correct    Session
 2         Pete          1         32         16          1
 3        Steve          2         31         15          1
 4         Dave          3         30         14          1,
 'Session2':    #Experiment Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
 0  ##Session 2        NaN        NaN        NaN        NaN
 1         Name         ID       Mean    Correct    Session
 2         Pete          1         30         14          2
 3        Steve          2         33         17          2
 4         Dave          3         32         16          2}

### Setting the Data type for data or columns

We can also, if we like, set the data type for the columns. Let’s read the example_sheets1.xlsx again. In the Pandas read_excel example below we use the dtype parameter to set the data type of some of the columns.

In [57]:
df = pd.read_excel('./Data/example_sheets1.xlsx',sheet_name='Session1',
                   header=1,dtype={'Names':str,'ID':str,
                                        'Mean':int, 'Session':str})

We can use the method `info` to see the what data types the different columns have:

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ##Session 1  4 non-null      object
 1   Unnamed: 1   4 non-null      object
 2   Unnamed: 2   4 non-null      object
 3   Unnamed: 3   4 non-null      object
 4   Unnamed: 4   4 non-null      object
dtypes: object(5)
memory usage: 288.0+ bytes

### Writing Pandas Dataframes to Excel

Excel files can, of course, be created in Python using the module Pandas. In this section of the post we will learn how to create an excel file using Pandas. We will start by creating a dataframe with some variables.

We will create the dataframe using a dictionary. The keys will be the column names and the values will be lists containing our data:

In [59]:
df = pd.DataFrame({'Names':['Andreas', 'George', 'Steve',
                           'Sarah', 'Joanna', 'Hanna'],
                  'Age':[21, 22, 20, 19, 18, 23]})

Then we write the dataframe to an Excel file using the `*to_excel*` method. In the Pandas `to_excel` example below we don’t use any parameters.

In [60]:
df.to_excel('./Data/NameAndAges.xlsx')

If we don’t use the parameter sheet_name we get the default sheet name, ‘Sheet1’. We can also see that we get a new column in our Excel file containing numbers. These are the indices from the dataframe.

If we want our sheet to be named something else and we don’t want the index column we can do like this:

In [61]:
df.to_excel('./Data/NamesAndAges.xlsx', sheet_name='Names and Ages', index=False)

### Writing Multiple Pandas Dataframes to an Excel File:

If we happen to have many dataframes that we want to store in one Excel file but on different sheets we can do this easily. However, we need to use ExcelWriter now:

In [67]:
# Need to install XlsxWriter: conda install XlsxWriter
import xlsxwriter

df1 = pd.DataFrame({'Names': ['Andreas', 'George', 'Steve',
                           'Sarah', 'Joanna', 'Hanna'],
                   'Age':[21, 22, 20, 19, 18, 23]})
 
df2 = pd.DataFrame({'Names': ['Pete', 'Jordan', 'Gustaf',
                           'Sophie', 'Sally', 'Simone'],
                   'Age':[22, 21, 19, 19, 29, 21]})
 
df3 = pd.DataFrame({'Names': ['Ulrich', 'Donald', 'Jon',
                           'Jessica', 'Elisabeth', 'Diana'],
                   'Age':[21, 21, 20, 19, 19, 22]})
 
dfs = {'Group1':df1, 'Group2':df2, 'Group3':df3}
writer = pd.ExcelWriter('./Data/NamesAndAges.xlsx', engine='xlsxwriter')
 
for sheet_name in dfs.keys():
    dfs[sheet_name].to_excel(writer, sheet_name=sheet_name, index=False)
    
writer.save()

In the code above we create 3 dataframes and then we continue to put them in a dictionary. Note, the keys are the sheet names and the cell names are the dataframes. After this is done we create a writer object using the xlsxwriter engine. We then continue by looping through the keys (i.e., sheet names) and add each sheet. Finally, the file is saved. This is important as leaving this out will not give you the intended results.